In [2]:
!pip install sqlalchemy pymysql

Requirement already satisfied: sqlalchemy in c:\users\dell\anaconda3\envs\sql_env\lib\site-packages (2.0.41)
Requirement already satisfied: pymysql in c:\users\dell\anaconda3\envs\sql_env\lib\site-packages (1.1.1)
Requirement already satisfied: greenlet>=1 in c:\users\dell\anaconda3\envs\sql_env\lib\site-packages (from sqlalchemy) (3.2.3)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\dell\anaconda3\envs\sql_env\lib\site-packages (from sqlalchemy) (4.12.2)

In [6]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [7]:
%sql mysql+pymysql://root:20056@localhost/library_borrowing_analysis

In [8]:
from sqlalchemy import create_engine
import pandas as pd

# بيانات الاتصال
username = 'root'            # اسم المستخدم بتاع MySQL
password = '20056'   # باسورد MySQL
host = 'localhost'           # أو 127.0.0.1
port = 3306                  # البورت الافتراضي
database = 'library_borrowing_analysis'  # اسم قاعدة البيانات

# عمل الاتصال
engine = create_engine(f"mysql+pymysql://{username}:{password}@{host}:{port}/{database}")

# مثال: عرض محتوى جدول books
df = pd.read_sql("SELECT * FROM books;", engine)
df.head()

   book_id           title  publication_year     genre  author_id
0        1          Utopia              2008    Sci-Fi          1
1        2      Metro 2033              2005    Sci-Fi          1
2        3  Harry Potter 1              1997   Fantasy          2
3        4  Harry Potter 2              1998   Fantasy          2
4        5            1984              1949  Dystopia          3

In [10]:
%%sql
WITH borrow_count AS (
    SELECT 
        member_id, 
        COUNT(*) AS borrow_total
    FROM 
        borrowings
    GROUP BY 
        member_id
)
SELECT 
    m.member_name, 
    bc.borrow_total
FROM 
    borrow_count AS bc
JOIN 
    members AS m 
ON 
    m.member_id = bc.member_id;

 * mysql+pymysql://root:***@localhost/library_borrowing_analysis
15 rows affected.

[('Fatma Badawy', 5),
 ('Ali Mohamed', 4),
 ('Nour El-Sherif', 4),
 ('Kareem Adel', 4),
 ('Hana Mostafa', 3),
 ('Sara Hany', 3),
 ('Mohamed Reda', 3),
 ('Laila Tarek', 3),
 ('Ahmed Yasser', 3),
 ('Salma Ehab', 3),
 ('Youssef Gamal', 3),
 ('Mariam Fathy', 3),
 ('Omar Hesham', 3),
 ('Reem Saeed', 3),
 ('Hossam Lotfy', 3)]

In [12]:
%%sql 
SELECT 
    br.borrow_date , 
    b.title , 
    m.member_name 
FROM 
    borrowings AS br 
JOIN 
    members AS m 
ON 
    m.member_id = br.member_id 
JOIN 
    books AS b 
ON 
    b.book_id = br.book_id 
WHERE 
    return_date IS NULL;

 * mysql+pymysql://root:***@localhost/library_borrowing_analysis
32 rows affected.

[(datetime.date(2024, 2, 5), 'Harry Potter 2', 'Nour El-Sherif'),
 (datetime.date(2024, 3, 20), 'The Shining', 'Sara Hany'),
 (datetime.date(2024, 4, 1), 'Murder on the Orient Express', 'Laila Tarek'),
 (datetime.date(2024, 4, 7), 'Cairo Trilogy', 'Salma Ehab'),
 (datetime.date(2024, 4, 20), 'Homo Deus', 'Omar Hesham'),
 (datetime.date(2024, 5, 1), 'Angels & Demons', 'Hossam Lotfy'),
 (datetime.date(2024, 5, 4), 'The Subtle Art of Not Giving a F*ck', 'Nour El-Sherif'),
 (datetime.date(2024, 5, 5), 'Everything is F*cked', 'Kareem Adel'),
 (datetime.date(2024, 5, 8), 'Death on the Nile', 'Mohamed Reda'),
 (datetime.date(2024, 5, 10), 'Brave New World', 'Ahmed Yasser'),
 (datetime.date(2024, 5, 11), 'The Alchemist', 'Salma Ehab'),
 (datetime.date(2024, 5, 13), 'Jane Eyre', 'Mariam Fathy'),
 (datetime.date(2024, 5, 14), 'Outliers', 'Omar Hesham'),
 (datetime.date(2024, 5, 17), 'Metro 2033', 'Fatma Badawy'),
 (datetime.date(2024, 5, 18), 'Harry Potter 1', 'Ali Mohamed'),
 (datetime.date(2024, 5, 19), 'Harry Potter 2', 'Nour El-Sherif'),
 (datetime.date(2024, 5, 20), '1984', 'Kareem Adel'),
 (datetime.date(2024, 5, 21), 'Animal Farm', 'Hana Mostafa'),
 (datetime.date(2024, 5, 22), 'The Shining', 'Sara Hany'),
 (datetime.date(2024, 5, 23), 'It', 'Mohamed Reda'),
 (datetime.date(2024, 5, 24), 'Murder on the Orient Express', 'Laila Tarek'),
 (datetime.date(2024, 5, 25), 'And Then There Were None', 'Ahmed Yasser'),
 (datetime.date(2024, 5, 26), 'Cairo Trilogy', 'Salma Ehab'),
 (datetime.date(2024, 5, 27), 'Children of the Alley', 'Youssef Gamal'),
 (datetime.date(2024, 5, 28), 'Sapiens', 'Mariam Fathy'),
 (datetime.date(2024, 5, 29), 'Homo Deus', 'Omar Hesham'),
 (datetime.date(2024, 5, 30), 'The Da Vinci Code', 'Reem Saeed'),
 (datetime.date(2024, 6, 1), 'Angels & Demons', 'Hossam Lotfy'),
 (datetime.date(2024, 6, 2), 'Pride and Prejudice', 'Fatma Badawy'),
 (datetime.date(2024, 6, 3), 'Sense and Sensibility', 'Ali Mohamed'),
 (datetime.date(2024, 6, 4), 'The Subtle Art of Not Giving a F*ck', 'Nour El-Sherif'),
 (datetime.date(2024, 6, 5), 'Everything is F*cked', 'Kareem Adel')]

In [13]:
%%sql 
WITH borrow_count AS (
    SELECT
        member_id,
        COUNT(*) AS borrow_total
    FROM 
        borrowings 
    GROUP BY 
        member_id 
) 

SELECT
    m.member_id,
    bc.borrow_total, 
    CASE 
        WHEN bc.borrow_total  >= 5 THEN 'high active' 
        WHEN bc.borrow_total  BETWEEN 2 AND 4 THEN 'active' 
        WHEN bc.borrow_total <= 2 THEN 'low active'
    END AS activitly_level
FROM 
    borrow_count AS bc
JOIN
    members AS m 
ON 
    bc.member_id = m.member_id;

 * mysql+pymysql://root:***@localhost/library_borrowing_analysis
15 rows affected.

[(1, 5, 'high active'),
 (2, 4, 'active'),
 (3, 4, 'active'),
 (4, 4, 'active'),
 (5, 3, 'active'),
 (6, 3, 'active'),
 (7, 3, 'active'),
 (8, 3, 'active'),
 (9, 3, 'active'),
 (10, 3, 'active'),
 (11, 3, 'active'),
 (12, 3, 'active'),
 (13, 3, 'active'),
 (14, 3, 'active'),
 (15, 3, 'active')]

In [14]:
%%sql 
WITH borrow_count AS (
    SELECT 
        member_id ,
        COUNT(*) AS borrow_total 
    FROM 
        borrowings 
    GROUP BY 
        member_id 
) 

SELECT 
    m.member_id ,
    bc.borrow_total ,
    RANK() OVER(ORDER BY bc.borrow_total DESC) AS rank_position 
FROM 
    borrow_count AS bc
JOIN 
    members AS m 
ON 
    bc.member_id = m.member_id

 * mysql+pymysql://root:***@localhost/library_borrowing_analysis
15 rows affected.

[(1, 5, 1),
 (2, 4, 2),
 (3, 4, 2),
 (4, 4, 2),
 (5, 3, 5),
 (6, 3, 5),
 (7, 3, 5),
 (8, 3, 5),
 (9, 3, 5),
 (10, 3, 5),
 (11, 3, 5),
 (12, 3, 5),
 (13, 3, 5),
 (14, 3, 5),
 (15, 3, 5)]

In [15]:
%%sql 
WITH borrow_count AS (
    SELECT 
        member_id ,
        COUNT(*) AS borrow_total 
    FROM 
        borrowings 
    GROUP BY 
        member_id 
) 

SELECT 
    m.member_id ,
    bc.borrow_total ,
    RANK() OVER(ORDER BY bc.borrow_total DESC) AS rank_position , 
    LAG(bc.borrow_total) OVER( ORDER BY bc.borrow_total DESC ) AS pervious_rank_position , 
    bc.borrow_total - LAG(bc.borrow_total) OVER( ORDER BY bc.borrow_total DESC ) AS different_rank_position 
FROM 
    borrow_count AS bc
JOIN 
    members AS m 
ON 
    bc.member_id = m.member_id

 * mysql+pymysql://root:***@localhost/library_borrowing_analysis
15 rows affected.

[(1, 5, 1, None, None),
 (2, 4, 2, 5, -1),
 (3, 4, 2, 4, 0),
 (4, 4, 2, 4, 0),
 (5, 3, 5, 4, -1),
 (6, 3, 5, 3, 0),
 (7, 3, 5, 3, 0),
 (8, 3, 5, 3, 0),
 (9, 3, 5, 3, 0),
 (10, 3, 5, 3, 0),
 (11, 3, 5, 3, 0),
 (12, 3, 5, 3, 0),
 (13, 3, 5, 3, 0),
 (14, 3, 5, 3, 0),
 (15, 3, 5, 3, 0)]

In [16]:
%%sql 
WITH borrow_count AS (
    SELECT 
        member_id ,
        COUNT(*) AS borrow_total 
    FROM 
        borrowings 
    GROUP BY 
        member_id 
) 

SELECT 
    m.member_id ,
    bc.borrow_total ,
    RANK() OVER(ORDER BY bc.borrow_total DESC) AS rank_position , 
    LAG(bc.borrow_total) OVER( ORDER BY bc.borrow_total DESC ) AS pervious_rank_position , 
    bc.borrow_total - LAG(bc.borrow_total) OVER( ORDER BY bc.borrow_total DESC ) AS different_rank_position ,
    LEAD(bc.borrow_total) OVER (ORDER BY bc.borrow_total DESC) AS next_position ,
    bc.borrow_total -LEAD(bc.borrow_total) OVER (ORDER BY bc.borrow_total DESC) AS different_next_position 
FROM 
    borrow_count AS bc
JOIN 
    members AS m 
ON 
    bc.member_id = m.member_id

 * mysql+pymysql://root:***@localhost/library_borrowing_analysis
15 rows affected.

[(1, 5, 1, None, None, 4, 1),
 (2, 4, 2, 5, -1, 4, 0),
 (3, 4, 2, 4, 0, 4, 0),
 (4, 4, 2, 4, 0, 3, 1),
 (5, 3, 5, 4, -1, 3, 0),
 (6, 3, 5, 3, 0, 3, 0),
 (7, 3, 5, 3, 0, 3, 0),
 (8, 3, 5, 3, 0, 3, 0),
 (9, 3, 5, 3, 0, 3, 0),
 (10, 3, 5, 3, 0, 3, 0),
 (11, 3, 5, 3, 0, 3, 0),
 (12, 3, 5, 3, 0, 3, 0),
 (13, 3, 5, 3, 0, 3, 0),
 (14, 3, 5, 3, 0, 3, 0),
 (15, 3, 5, 3, 0, None, None)]

In [18]:
%%sql
SELECT * FROM member_borrowing_analysis;

 * mysql+pymysql://root:***@localhost/library_borrowing_analysis
15 rows affected.

[(1, 5, 1, None, None, 4, 1),
 (2, 4, 2, 5, -1, 4, 0),
 (3, 4, 2, 4, 0, 4, 0),
 (4, 4, 2, 4, 0, 3, 1),
 (5, 3, 5, 4, -1, 3, 0),
 (6, 3, 5, 3, 0, 3, 0),
 (7, 3, 5, 3, 0, 3, 0),
 (8, 3, 5, 3, 0, 3, 0),
 (9, 3, 5, 3, 0, 3, 0),
 (10, 3, 5, 3, 0, 3, 0),
 (11, 3, 5, 3, 0, 3, 0),
 (12, 3, 5, 3, 0, 3, 0),
 (13, 3, 5, 3, 0, 3, 0),
 (14, 3, 5, 3, 0, 3, 0),
 (15, 3, 5, 3, 0, None, None)]

In [20]:
%%sql
WITH borrow_count AS (
    SELECT 
        member_id,
        COUNT(*) AS borrow_total 
    FROM 
        borrowings 
    GROUP BY 
        member_id 
) 

SELECT 
    m.member_id,
    bc.borrow_total,
    RANK() OVER (ORDER BY bc.borrow_total DESC) AS rank_position, 
    LAG(bc.borrow_total) OVER (ORDER BY bc.borrow_total DESC) AS previous_rank_position, 
    bc.borrow_total - LAG(bc.borrow_total) OVER (ORDER BY bc.borrow_total DESC) AS different_rank_position,
    CASE 
        WHEN bc.borrow_total >= 5 THEN 'high active' 
        WHEN bc.borrow_total BETWEEN 2 AND 4 THEN 'active' 
        ELSE 'low active'
    END AS activity_level
FROM 
    borrow_count AS bc
JOIN
    members AS m 
ON 
    bc.member_id = m.member_id;

 * mysql+pymysql://root:***@localhost/library_borrowing_analysis
15 rows affected.

[(1, 5, 1, None, None, 'high active'),
 (2, 4, 2, 5, -1, 'active'),
 (3, 4, 2, 4, 0, 'active'),
 (4, 4, 2, 4, 0, 'active'),
 (5, 3, 5, 4, -1, 'active'),
 (6, 3, 5, 3, 0, 'active'),
 (7, 3, 5, 3, 0, 'active'),
 (8, 3, 5, 3, 0, 'active'),
 (9, 3, 5, 3, 0, 'active'),
 (10, 3, 5, 3, 0, 'active'),
 (11, 3, 5, 3, 0, 'active'),
 (12, 3, 5, 3, 0, 'active'),
 (13, 3, 5, 3, 0, 'active'),
 (14, 3, 5, 3, 0, 'active'),
 (15, 3, 5, 3, 0, 'active')]

In [21]:
%%sql 
SELECT 
    *
FROM 
    member_borrowing_analysis;

 * mysql+pymysql://root:***@localhost/library_borrowing_analysis
15 rows affected.

[(1, 'Fatma Badawy', 5, 1, None, None, 4, 1, 'Active'),
 (2, 'Ali Mohamed', 4, 2, 5, -1, 4, 0, 'Low Activity'),
 (3, 'Nour El-Sherif', 4, 2, 4, 0, 4, 0, 'Low Activity'),
 (4, 'Kareem Adel', 4, 2, 4, 0, 3, 1, 'Low Activity'),
 (5, 'Hana Mostafa', 3, 5, 4, -1, 3, 0, 'Low Activity'),
 (6, 'Sara Hany', 3, 5, 3, 0, 3, 0, 'Low Activity'),
 (7, 'Mohamed Reda', 3, 5, 3, 0, 3, 0, 'Low Activity'),
 (8, 'Laila Tarek', 3, 5, 3, 0, 3, 0, 'Low Activity'),
 (9, 'Ahmed Yasser', 3, 5, 3, 0, 3, 0, 'Low Activity'),
 (10, 'Salma Ehab', 3, 5, 3, 0, 3, 0, 'Low Activity'),
 (11, 'Youssef Gamal', 3, 5, 3, 0, 3, 0, 'Low Activity'),
 (12, 'Mariam Fathy', 3, 5, 3, 0, 3, 0, 'Low Activity'),
 (13, 'Omar Hesham', 3, 5, 3, 0, 3, 0, 'Low Activity'),
 (14, 'Reem Saeed', 3, 5, 3, 0, 3, 0, 'Low Activity'),
 (15, 'Hossam Lotfy', 3, 5, 3, 0, None, None, 'Low Activity')]

In [22]:
%%sql
WITH genre_count AS (
    SELECT 
        b.genre,
        COUNT(*) AS borrow_total  
    FROM  
        borrowings AS br 
    JOIN 
        books AS b 
    ON 
        b.book_id = br.book_id
    GROUP BY 
        b.genre
)
SELECT 
    genre,
    borrow_total
FROM 
    genre_count
ORDER BY 
    borrow_total DESC;

 * mysql+pymysql://root:***@localhost/library_borrowing_analysis
17 rows affected.

[('Horror', 6),
 ('Mystery', 5),
 ('Romance', 5),
 ('Sci-Fi', 4),
 ('Fantasy', 4),
 ('Dystopia', 4),
 ('Thriller', 4),
 ('Self-help', 4),
 ('Satire', 2),
 ('Historical', 2),
 ('Political Fiction', 2),
 ('History', 2),
 ('Philosophy', 2),
 ('Tech Thriller', 1),
 ('Adventure', 1),
 ('Business', 1),
 ('Psychology', 1)]

In [23]:
%%sql
WITH genre_count AS (
    SELECT 
        b.title,
        COUNT(*) AS borrow_total  
    FROM  
        borrowings AS br 
    JOIN 
        books AS b 
    ON 
        b.book_id = br.book_id
    GROUP BY 
        b.title
)
SELECT 
    title,
    borrow_total
FROM 
    genre_count
ORDER BY 
    borrow_total DESC;

 * mysql+pymysql://root:***@localhost/library_borrowing_analysis
30 rows affected.

[('Utopia', 2),
 ('Metro 2033', 2),
 ('Harry Potter 1', 2),
 ('Harry Potter 2', 2),
 ('1984', 2),
 ('Animal Farm', 2),
 ('The Shining', 2),
 ('It', 2),
 ('Murder on the Orient Express', 2),
 ('And Then There Were None', 2),
 ('Cairo Trilogy', 2),
 ('Children of the Alley', 2),
 ('Sapiens', 2),
 ('Homo Deus', 2),
 ('The Da Vinci Code', 2),
 ('Angels & Demons', 2),
 ('Pride and Prejudice', 2),
 ('Sense and Sensibility', 2),
 ('The Subtle Art of Not Giving a F*ck', 2),
 ('Everything is F*cked', 2),
 ('Mockingjay', 1),
 ('Misery', 1),
 ('Death on the Nile', 1),
 ('Digital Fortress', 1),
 ('Brave New World', 1),
 ('The Alchemist', 1),
 ('Zero to One', 1),
 ('Jane Eyre', 1),
 ('Outliers', 1),
 ('The Institute', 1)]

In [24]:
%%sql
with diff_days AS ( 
    SELECT 
       DATEDIFF(return_date , borrow_date) AS days_off
    FROM 
        borrowings 
    WHERE
        return_date IS NOT NULL ) 
SELECT 
    AVG(days_off) AS avg_days,
CASE 
    WHEN AVG(days_off) >= 50 THEN 'RETURN slow ' 
    WHEN AVG(days_off) BETWEEN 20 AND 40 THEN 'RETURN well ' 
    ELSE  'RETURN fast' 
    END AS return_category
FROM 
    diff_days ;

 * mysql+pymysql://root:***@localhost/library_borrowing_analysis
1 rows affected.

[(Decimal('10.7222'), 'RETURN fast')]

In [25]:
%%sql 
WITH member_days AS (
    SELECT 
        m.member_id , 
        m.member_name ,
        DATEDIFF(return_date , borrow_date) AS days_off
    FROM 
        borrowings AS br 
    JOIN 
        members AS m 
    ON 
        m.member_id = br.member_id
    WHERE 
        return_date IS NOT NULL 
        ),

avg_days_per_member AS (
    SELECT 
        member_id , 
        member_name ,
        AVG(days_off) AS avg_days
    FROM 
        member_days 
    GROUP BY 
        member_id , member_name ) 

SELECT 
    member_id , 
    member_name ,
    avg_days , 
    CASE
        WHEN avg_days > 50 THEN 'RETURN SLOW ' 
        WHEN avg_days BETWEEN 20 and 40 THEN 'RETURN GOOD ' 
        ELSE 'RETURN FAST'
    END AS return_category
FROM avg_days_per_member ;

 * mysql+pymysql://root:***@localhost/library_borrowing_analysis
12 rows affected.

[(1, 'Fatma Badawy', Decimal('7.6667'), 'RETURN FAST'),
 (2, 'Ali Mohamed', Decimal('12.0000'), 'RETURN FAST'),
 (4, 'Kareem Adel', Decimal('14.0000'), 'RETURN FAST'),
 (5, 'Hana Mostafa', Decimal('12.0000'), 'RETURN FAST'),
 (6, 'Sara Hany', Decimal('14.0000'), 'RETURN FAST'),
 (7, 'Mohamed Reda', Decimal('11.0000'), 'RETURN FAST'),
 (8, 'Laila Tarek', Decimal('16.0000'), 'RETURN FAST'),
 (9, 'Ahmed Yasser', Decimal('15.0000'), 'RETURN FAST'),
 (11, 'Youssef Gamal', Decimal('7.5000'), 'RETURN FAST'),
 (12, 'Mariam Fathy', Decimal('10.0000'), 'RETURN FAST'),
 (14, 'Reem Saeed', Decimal('10.5000'), 'RETURN FAST'),
 (15, 'Hossam Lotfy', Decimal('6.0000'), 'RETURN FAST')]

In [26]:
%%sql 
SELECT 
    *
FROM 
    member_borrowing_analysis;

 * mysql+pymysql://root:***@localhost/library_borrowing_analysis
12 rows affected.

[(1, 'Fatma Badawy', Decimal('7.6667'), 'RETURN FAST'),
 (2, 'Ali Mohamed', Decimal('12.0000'), 'RETURN FAST'),
 (4, 'Kareem Adel', Decimal('14.0000'), 'RETURN FAST'),
 (5, 'Hana Mostafa', Decimal('12.0000'), 'RETURN FAST'),
 (6, 'Sara Hany', Decimal('14.0000'), 'RETURN FAST'),
 (7, 'Mohamed Reda', Decimal('11.0000'), 'RETURN FAST'),
 (8, 'Laila Tarek', Decimal('16.0000'), 'RETURN FAST'),
 (9, 'Ahmed Yasser', Decimal('15.0000'), 'RETURN FAST'),
 (11, 'Youssef Gamal', Decimal('7.5000'), 'RETURN FAST'),
 (12, 'Mariam Fathy', Decimal('10.0000'), 'RETURN FAST'),
 (14, 'Reem Saeed', Decimal('10.5000'), 'RETURN FAST'),
 (15, 'Hossam Lotfy', Decimal('6.0000'), 'RETURN FAST')]

In [29]:
%%sql 
SELECT 
    m.member_id ,
    m.member_name ,
    COUNT(br.borrow_id) AS total_borrow 
FROM 
    borrowings AS br 
JOIN 
    members AS m 
ON 
     m.member_id = br.member_id 
GROUP BY 
     m.member_id ,m.member_name 
ORDER BY 
    total_borrow  DESC;

 * mysql+pymysql://root:***@localhost/library_borrowing_analysis
15 rows affected.

[(1, 'Fatma Badawy', 5),
 (2, 'Ali Mohamed', 4),
 (3, 'Nour El-Sherif', 4),
 (4, 'Kareem Adel', 4),
 (5, 'Hana Mostafa', 3),
 (6, 'Sara Hany', 3),
 (7, 'Mohamed Reda', 3),
 (8, 'Laila Tarek', 3),
 (9, 'Ahmed Yasser', 3),
 (10, 'Salma Ehab', 3),
 (11, 'Youssef Gamal', 3),
 (12, 'Mariam Fathy', 3),
 (13, 'Omar Hesham', 3),
 (14, 'Reem Saeed', 3),
 (15, 'Hossam Lotfy', 3)]

In [30]:
%%sql 
SELECT 
    m.member_id ,
    m.member_name ,
    COUNT(br.borrow_id) AS total_borrow ,
    CASE
        WHEN COUNT(br.borrow_id)>= 50 THEN'BORROW WELL' 
        WHEN COUNT(br.borrow_id) BETWEEN 20 AND 40 THEN 'BORROW GOOD ' 
        ELSE 'BPRROW BAD ' 
    END AS reader_level
FROM 
    borrowings AS br 
JOIN 
    members AS m 
ON 
     m.member_id = br.member_id 
GROUP BY 
     m.member_id ,m.member_name 
ORDER BY 
    total_borrow DESC;

 * mysql+pymysql://root:***@localhost/library_borrowing_analysis
15 rows affected.

[(1, 'Fatma Badawy', 5, 'BPRROW BAD '),
 (2, 'Ali Mohamed', 4, 'BPRROW BAD '),
 (3, 'Nour El-Sherif', 4, 'BPRROW BAD '),
 (4, 'Kareem Adel', 4, 'BPRROW BAD '),
 (5, 'Hana Mostafa', 3, 'BPRROW BAD '),
 (6, 'Sara Hany', 3, 'BPRROW BAD '),
 (7, 'Mohamed Reda', 3, 'BPRROW BAD '),
 (8, 'Laila Tarek', 3, 'BPRROW BAD '),
 (9, 'Ahmed Yasser', 3, 'BPRROW BAD '),
 (10, 'Salma Ehab', 3, 'BPRROW BAD '),
 (11, 'Youssef Gamal', 3, 'BPRROW BAD '),
 (12, 'Mariam Fathy', 3, 'BPRROW BAD '),
 (13, 'Omar Hesham', 3, 'BPRROW BAD '),
 (14, 'Reem Saeed', 3, 'BPRROW BAD '),
 (15, 'Hossam Lotfy', 3, 'BPRROW BAD ')]

In [31]:
%%sql
WITH reader_levels AS (
    SELECT 
        m.member_id,
        CASE
            WHEN COUNT(br.borrow_id) >= 50 THEN 'BORROW WELL'
            WHEN COUNT(br.borrow_id) BETWEEN 20 AND 40 THEN 'BORROW GOOD'
            ELSE 'BORROW BAD'
        END AS reader_level
    FROM 
        borrowings AS br
    JOIN 
        members AS m ON m.member_id = br.member_id
    GROUP BY 
        m.member_id
),

borrow_with_genre AS (
    SELECT 
        rl.reader_level,
        b.genre
    FROM 
        borrowings AS br
    JOIN 
        reader_levels AS rl ON br.member_id = rl.member_id
    JOIN 
        books AS b ON br.book_id = b.book_id
)

SELECT 
    reader_level,
    genre,
    COUNT(*) AS borrow_count
FROM 
    borrow_with_genre
GROUP BY 
    reader_level, genre
ORDER BY 
    reader_level, borrow_count DESC;

 * mysql+pymysql://root:***@localhost/library_borrowing_analysis
17 rows affected.

[('BORROW BAD', 'Horror', 6),
 ('BORROW BAD', 'Mystery', 5),
 ('BORROW BAD', 'Romance', 5),
 ('BORROW BAD', 'Sci-Fi', 4),
 ('BORROW BAD', 'Fantasy', 4),
 ('BORROW BAD', 'Dystopia', 4),
 ('BORROW BAD', 'Thriller', 4),
 ('BORROW BAD', 'Self-help', 4),
 ('BORROW BAD', 'Satire', 2),
 ('BORROW BAD', 'Historical', 2),
 ('BORROW BAD', 'Political Fiction', 2),
 ('BORROW BAD', 'History', 2),
 ('BORROW BAD', 'Philosophy', 2),
 ('BORROW BAD', 'Tech Thriller', 1),
 ('BORROW BAD', 'Adventure', 1),
 ('BORROW BAD', 'Business', 1),
 ('BORROW BAD', 'Psychology', 1)]

In [32]:
%%sql 
SELECT 
    *
FROM 
    member_borrowing_analysis;

 * mysql+pymysql://root:***@localhost/library_borrowing_analysis
17 rows affected.

[('BORROW BAD', 'Sci-Fi', 4),
 ('BORROW BAD', 'Fantasy', 4),
 ('BORROW BAD', 'Dystopia', 4),
 ('BORROW BAD', 'Satire', 2),
 ('BORROW BAD', 'Horror', 6),
 ('BORROW BAD', 'Mystery', 5),
 ('BORROW BAD', 'Historical', 2),
 ('BORROW BAD', 'Political Fiction', 2),
 ('BORROW BAD', 'History', 2),
 ('BORROW BAD', 'Philosophy', 2),
 ('BORROW BAD', 'Thriller', 4),
 ('BORROW BAD', 'Romance', 5),
 ('BORROW BAD', 'Self-help', 4),
 ('BORROW BAD', 'Tech Thriller', 1),
 ('BORROW BAD', 'Adventure', 1),
 ('BORROW BAD', 'Business', 1),
 ('BORROW BAD', 'Psychology', 1)]

In [34]:
%%sql
WITH reader_levels AS (
    SELECT 
        m.member_id,
        CASE 
            WHEN COUNT(br.borrow_id) >= 50 THEN 'BORROW WELL'
            WHEN COUNT(br.borrow_id) BETWEEN 20 AND 40 THEN 'BORROW GOOD'
            ELSE 'BORROW BAD'
        END AS reader_level 
    FROM 
        borrowings AS br 
    JOIN 
        members AS m 
    ON 
        m.member_id = br.member_id 
    GROUP BY 
        m.member_id
), 
reader_borrow_days AS (
    SELECT 
        r.reader_level, 
        DATEDIFF(br.return_date, br.borrow_date) AS day_off 
    FROM 
        borrowings AS br 
    JOIN 
        reader_levels AS r         
    ON 
        r.member_id = br.member_id 
    WHERE 
        br.return_date IS NOT NULL 
)

SELECT
    reader_level, 
    ROUND(AVG(day_off), 2) AS avg_day
FROM 
    reader_borrow_days 
GROUP BY 
    reader_level;

 * mysql+pymysql://root:***@localhost/library_borrowing_analysis
1 rows affected.

[('BORROW BAD', Decimal('10.72'))]

In [35]:
%%sql 
SELECT 
    MONTH(borrow_date) AS borrow_month ,
    COUNT(*) AS borrow_count 
FROM 
    borrowings 
GROUP BY 
    borrow_month 
ORDER BY 
    borrow_count DESC ;

 * mysql+pymysql://root:***@localhost/library_borrowing_analysis
6 rows affected.

[(5, 30), (4, 7), (6, 5), (3, 4), (1, 2), (2, 2)]

In [38]:
%%sql 
SELECT 
    a.author_name ,
    COUNT(*) AS author_count 
FROM 
    borrowings AS br 
JOIN 
    books AS b 
ON 
    b.book_id = br.book_id 
JOIN 
    authors AS a 
ON 
    a.author_id = b.author_id
GROUP BY 
    a.author_name 
ORDER BY 
    author_count;

 * mysql+pymysql://root:***@localhost/library_borrowing_analysis
10 rows affected.

[('Naguib Mahfouz', 4),
 ('Yuval Noah Harari', 4),
 ('Ahmed Khaled Tawfik', 5),
 ('J.K. Rowling', 5),
 ('George Orwell', 5),
 ('Agatha Christie', 5),
 ('Dan Brown', 5),
 ('Jane Austen', 5),
 ('Stephen King', 6),
 ('Mark Manson', 6)]

In [42]:
%%sql 
SELECT 
    m.member_name ,
    COUNT(*) AS late_return 
FROM 
    borrowings AS br 
JOIN 
    members AS m 
ON 
    m.member_id = br.member_id 
WHERE 
    DATEDIFF(return_date,borrow_date) > 30 
GROUP BY 
    m.member_name 
ORDER BY 
    late_return DESC ;

 * mysql+pymysql://root:***@localhost/library_borrowing_analysis
0 rows affected.

[]